#include<stdio.h>
int main(void) {
	/*
	// 다차원 배열
	int i; // □
	int arr[5] = { 1,2,3,4,5 };
	// □□□□□
	int arr2[2][5] = 
	{
		{ 1,2,3,4,5 },
		{ 6,7,8,9,10}
	}; // 이런식으로 직접 눈으로 보이게 선언하면 개꿀떡이다
	// □□□□□
	// □□□□□

	// [0,0] [0,1] [0,2] [0,3] [0,4] -> ex) arr2[0][4];
	// [1,0] [1,1] [1,2] [1,3] [1,4] -> ex) arr2[1][2];
	*/
	int arr[4][2] = {
		{1,2},
		{3,4},
		{5,6},
		{7,8}
	};
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 2; j++) {
			printf("arr[%d][%d]의 값은 %d\n", i, j, arr[i][j]);
		}
		printf("\n");
		}
	int arr2[3][3][3]=
	{
		{
			{1,2,3},
			{4,5,6},
			{7,8,9}
		},
		{
			{ 1,2,3 },
			{ 4,5,6 },
			{ 7,8,9 }
		},
		{
			{ 1,2,3 },
			{ 4,5,6 },
			{ 7,8,9 }
		}
	};
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			for (int k = 0; k < 3; k++) {
				printf("arr2[%d][%d][%d]의 값은 %d\n", i, j, k, arr2[i][j][k]);
			}
			printf("\n");
		}
		printf("\n");
	}
	return 0;
}